summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxInt_regdef.h
/** \\brief  Service Request Broadcast Register 0 */
typedef struct _Ifx_INT_SRB0_Bits
{
    unsigned int TRIG0:1;                   /**< \brief [0:0] General Purpose Service Request Trigger 0 (w) */
    unsigned int TRIG1:1;                   /**< \brief [1:1] General Purpose Service Request Trigger 1 (w) */
    unsigned int TRIG2:1;                   /**< \brief [2:2] General Purpose Service Request Trigger 2 (w) */
    unsigned int TRIG3:1;                   /**< \brief [3:3] General Purpose Service Request Trigger 3 (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_INT_SRB0_Bits;

/** \\brief  Service Request Broadcast Register 1 */
typedef struct _Ifx_INT_SRB1_Bits
{
    unsigned int TRIG0:1;                   /**< \brief [0:0] General Purpose Service Request Trigger 0 (w) */
    unsigned int TRIG1:1;                   /**< \brief [1:1] General Purpose Service Request Trigger 1 (w) */
    unsigned int TRIG2:1;                   /**< \brief [2:2] General Purpose Service Request Trigger 2 (w) */
    unsigned int TRIG3:1;                   /**< \brief [3:3] General Purpose Service Request Trigger 3 (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_INT_SRB1_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ACCEN00_Bits B;
} Ifx_INT_ACCEN00;

/** \\brief  Kernel 0 Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ACCEN01_Bits B;
} Ifx_INT_ACCEN01;

/** \\brief  Kernel 1 Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ACCEN10_Bits B;
} Ifx_INT_ACCEN10;

/** \\brief  Kernel 1 Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ACCEN11_Bits B;
} Ifx_INT_ACCEN11;

/** \\brief  Error Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ICU_ECR_Bits B;
} Ifx_INT_ICU_ECR;

/** \\brief  Last Acknowledged Service Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ICU_LASR_Bits B;
} Ifx_INT_ICU_LASR;

/** \\brief  Latest Winning Service Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ICU_LWSR_Bits B;
} Ifx_INT_ICU_LWSR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_ID_Bits B;
} Ifx_INT_ID;

/** \\brief  OTGM IRQ Trace */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OIT_Bits B;
} Ifx_INT_OIT;

/** \\brief  OTGM IRQ MUX Missed IRQ Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OIXMS_Bits B;
} Ifx_INT_OIXMS;

/** \\brief  OTGM IRQ MUX Select 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OIXS0_Bits B;
} Ifx_INT_OIXS0;

/** \\brief  OTGM IRQ MUX Select 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OIXS1_Bits B;
} Ifx_INT_OIXS1;

/** \\brief  OTGM IRQ MUX Trigger Set Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OIXTS_Bits B;
} Ifx_INT_OIXTS;

/** \\brief  OTGM MCDS I/F Sensitivity Negedge */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OMISN_Bits B;
} Ifx_INT_OMISN;

/** \\brief  OTGM MCDS I/F Sensitivity Posedge */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OMISP_Bits B;
} Ifx_INT_OMISP;

/** \\brief  OTGM OTGB0/1 Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OOBS_Bits B;
} Ifx_INT_OOBS;

/** \\brief  OTGM SSI Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_OSSIC_Bits B;
} Ifx_INT_OSSIC;

/** \\brief  Service Request Broadcast Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_SRB0_Bits B;
} Ifx_INT_SRB0;

/** \\brief  Service Request Broadcast Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_INT_SRB1_Bits B;
} Ifx_INT_SRB1;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

