summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxInt_regdef.h
/** \\brief  Interrupt router channel */
typedef volatile struct _Ifx_INT_ICU
{
    Ifx_INT_ICU_LWSR LWSR;                  /**< \brief 0, Latest Winning Service Request Register */
    Ifx_INT_ICU_LASR LASR;                  /**< \brief 4, Last Acknowledged Service Request Register */
    Ifx_INT_ICU_ECR ECR;                    /**< \brief 8, Error Capture Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
} Ifx_INT_ICU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  Interrupt router object */
typedef volatile struct _Ifx_INT
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_INT_ID ID;                          /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_INT_SRB0 SRB0;                      /**< \brief 10, Service Request Broadcast Register 0 */
    Ifx_INT_SRB1 SRB1;                      /**< \brief 14, Service Request Broadcast Register 1 */
    unsigned char reserved_18[104];         /**< \brief 18, \internal Reserved */
    Ifx_INT_OOBS OOBS;                      /**< \brief 80, OTGM OTGB0/1 Status */
    Ifx_INT_OSSIC OSSIC;                    /**< \brief 84, OTGM SSI Control */
    Ifx_INT_OIXTS OIXTS;                    /**< \brief 88, OTGM IRQ MUX Trigger Set Select */
    Ifx_INT_OIXMS OIXMS;                    /**< \brief 8C, OTGM IRQ MUX Missed IRQ Select */
    Ifx_INT_OIXS0 OIXS0;                    /**< \brief 90, OTGM IRQ MUX Select 0 */
    Ifx_INT_OIXS1 OIXS1;                    /**< \brief 94, OTGM IRQ MUX Select 1 */
    unsigned char reserved_98[8];           /**< \brief 98, \internal Reserved */
    Ifx_INT_OIT OIT;                        /**< \brief A0, OTGM IRQ Trace */
    Ifx_INT_OMISP OMISP;                    /**< \brief A4, OTGM MCDS I/F Sensitivity Posedge */
    Ifx_INT_OMISN OMISN;                    /**< \brief A8, OTGM MCDS I/F Sensitivity Negedge */
    unsigned char reserved_AC[68];          /**< \brief AC, \internal Reserved */
    Ifx_INT_ACCEN01 ACCEN01;                /**< \brief F0, Kernel 0 Access Enable Register 1 */
    Ifx_INT_ACCEN00 ACCEN00;                /**< \brief F4, Access Enable Register 0 */
    Ifx_INT_ACCEN11 ACCEN11;                /**< \brief F8, Kernel 1 Access Enable Register 1 */
    Ifx_INT_ACCEN10 ACCEN10;                /**< \brief FC, Kernel 1 Access Enable Register 0 */
    Ifx_INT_ICU CH0;                        /**< \brief 100, Interrupt router channel */
    Ifx_INT_ICU CH1;                        /**< \brief 110, Interrupt router channel */
    unsigned char reserved_120[16];         /**< \brief 120, \internal Reserved */
    Ifx_INT_ICU CH3;                        /**< \brief 130, Interrupt router channel */
    unsigned char reserved_140[3776];       /**< \brief 140, \internal Reserved */
} Ifx_INT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXINT_REGDEF_H */
